# constants.py

from config import settings

MEGAPLAN_API_URL = settings.MEGAPLAN_API_URL
MEGAPLAN_API_KEY = settings.MEGAPLAN_API_KEY
MEGAPLAN_HEADER = {
    "Authorization": f"Bearer {MEGAPLAN_API_KEY}",
    "Content-Type": "application/json"
}

PROGRAM_TRIGGER_DICT = {
    "7": {  # БП01.3 РЕАЛИЗАЦИЯ
        "326": "ЭнергоИнжиниринг Банк - АО \"Альфа-Банк\"",
        "1382": "ЭнергоИнжиниринг Банк - ПАО \"Сбербанк\"",
        "1383": "ЭнергоИнжиниринг Банк - АО АИКБ \"Енисейск.Объед.Банк\"",
        "1380": "ЭнергоС Банк - АО \"Альфа-Банк\"",
        "1381": "КрасЭнергоПроект Банк - АО \"Альфа-Банк\""
    },
    "15": {  # БП12 БЫСТРАЯ ПРОДАЖА
        "847": "ЭнергоИнжиниринг Банк - АО \"Альфа-Банк\"",
        "1389": "ЭнергоИнжиниринг Банк - ПАО \"Сбербанк\"",
        "1390": "ЭнергоИнжиниринг Банк - АО АИКБ \"Енисейск.Объед.Банк\"",
        "1391": "ЭнергоС Банк - АО \"Альфа-Банк\"",
        "1392": "КрасЭнергоПроект Банк - АО \"Альфа-Банк\""
    }
}